target/classes/wsdl/PagosYAportesPort.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10-b140319.1121 svn-revision#7b34660d6bc70e587e8ec81a17e4d76af68816a6. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10-b140319.1121 svn-revision#7b34660d6bc70e587e8ec81a17e4d76af68816a6. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.ws.bicevida.cl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://service.ws.bicevida.cl/" name="PagosYAportesWS">
<types>
<xsd:schema>
<xsd:import namespace="http://service.ws.bicevida.cl/" schemaLocation="http://169.254.194.130:7101/si12/pagosyaportesWS/PagosYAportesPort?xsd=1"/>
</xsd:schema>
</types>
<message name="getPagosYAportes">
<part name="parameters" element="tns:getPagosYAportes"/>
</message>
<message name="getPagosYAportesResponse">
<part name="parameters" element="tns:getPagosYAportesResponse"/>
</message>
<message name="PagosYAportesSoapException">
<part name="fault" element="tns:PagosYAportesSoapException"/>
</message>
<portType name="PagosyAportes">
<operation name="getPagosYAportes">
<input wsam:Action="http://service.ws.bicevida.cl/PagosyAportes/getPagosYAportesRequest" message="tns:getPagosYAportes"/>
<output wsam:Action="http://service.ws.bicevida.cl/PagosyAportes/getPagosYAportesResponse" message="tns:getPagosYAportesResponse"/>
<fault message="tns:PagosYAportesSoapException" name="PagosYAportesSoapException" wsam:Action="http://service.ws.bicevida.cl/PagosyAportes/getPagosYAportes/Fault/PagosYAportesSoapException"/>
</operation>
</portType>
<binding name="PagosyAportesPortBinding" type="tns:PagosyAportes">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="getPagosYAportes">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="PagosYAportesSoapException">
<soap:fault name="PagosYAportesSoapException" use="literal"/>
</fault>
</operation>
</binding>
<service name="PagosYAportesWS">
<port name="PagosyAportesPort" binding="tns:PagosyAportesPortBinding">
<soap:address location="http://169.254.194.130:7101/si12/pagosyaportesWS/PagosYAportesPort"/>
</port>
</service>
</definitions>